#include "base_wnd.h"

/********************************************************************
;[Name]
;	ClsBaseWnd
;[Action]
;	コンストラクタ
;[Input]
;	なし
;[Output]
;	なし
;
;coding :__/__/__:1.00:___:__________________________________________
;update :__/__/__:_.__:___:__________________________________________
;coding :__/__/__:_.__:___:__________________________________________
;bugfix :__/__/__:_.__:___:__________________________________________
;sysfix :__/__/__:_.__:___:__________________________________________
[MainTopic]
********************************************************************/
ClsBaseWnd::ClsBaseWnd()
{
} // End Of Fnc

/********************************************************************
;[Name]
;	~ClsBaseWnd
;[Action]
;	デストラクタ
;[Input]
;	なし
;[Output]
;	なし
;
;coding :__/__/__:1.00:___:__________________________________________
;update :__/__/__:_.__:___:__________________________________________
;coding :__/__/__:_.__:___:__________________________________________
;bugfix :__/__/__:_.__:___:__________________________________________
;sysfix :__/__/__:_.__:___:__________________________________________
[MainTopic]
********************************************************************/
ClsBaseWnd::~ClsBaseWnd()
{
} // End Of Fnc

/********************************************************************
;[Name]
;	create_wnd
;[Action]
;	ウィンドウを作成する
;[Input]
;	dwExStyle		拡張スタイル
;	lpWindowName	ウィンドウ名
;	dwStyle			ウィンドウスタイル
;	x				x座標
;	y				y座標
;	width			幅
;	height			高さ
;	hwndParent		親ウィンドウハンドル
;	hMenu			メニューハンドル
;[Output]
;	BOOL	処理結果
;
;coding :__/__/__:1.00:___:__________________________________________
;update :__/__/__:_.__:___:__________________________________________
;coding :__/__/__:_.__:___:__________________________________________
;bugfix :__/__/__:_.__:___:__________________________________________
;sysfix :__/__/__:_.__:___:__________________________________________
[MainTopic]
********************************************************************/
BOOL ClsBaseWnd
::create_wnd(DWORD dwExStyle, LPCTSTR lpWindowName, DWORD dwStyle,
							int x, int y, int width, int height, HWND hwndParent, HMENU hMenu)
{
	if(m_hWnd)
	{
		return FALSE;
	} // End Of If
	
	if(CreateWindowEx(dwExStyle, BASE_WND, lpWindowName, dwStyle,
		x, y, width, height, hwndParent, hMenu, get_hInstance(), this))
	{
		return TRUE;
	}
	else
	{
		return FALSE;
	} // End Of If
} // End Of Fnc

/********************************************************************
;[Name]
;	destroy_wnd
;[Action]
;	ウィンドウを破棄する
;[Input]
;	なし
;[Output]
;	なし
;
;coding :__/__/__:1.00:___:__________________________________________
;update :__/__/__:_.__:___:__________________________________________
;coding :__/__/__:_.__:___:__________________________________________
;bugfix :__/__/__:_.__:___:__________________________________________
;sysfix :__/__/__:_.__:___:__________________________________________
[MainTopic]
********************************************************************/
void ClsBaseWnd::destroy_wnd()
{
	if(m_hWnd)
	{
		// ウィンドウ破棄
		DestroyWindow(m_hWnd);
		m_hWnd = NULL;
	} // End Of If
} // End Of Fnc

/********************************************************************
;[Name]
;	wnd_proc
;[Action]
;	ウィンドウプロシージャ
;[Input]
;	hWnd	ウィンドウズハンドル
;	Msg		メッセージID
;	wParam	WPARAM
;	lParam	LPARAM
;[Output]
;	LRESULT	処理結果
;
;coding :__/__/__:1.00:___:__________________________________________
;update :__/__/__:_.__:___:__________________________________________
;coding :__/__/__:_.__:___:__________________________________________
;bugfix :__/__/__:_.__:___:__________________________________________
;sysfix :__/__/__:_.__:___:__________________________________________
[MainTopic]
********************************************************************/
LRESULT ClsBaseWnd
::wnd_proc(HWND hWnd, UINT Msg, WPARAM wParam, LPARAM lParam)
{
	// デフォルトウィンドウプロシージャ呼ぶだけ
	return DefWindowProc(hWnd, Msg, wParam, lParam);
} // End Of Fnc
